import { Button } from '@/components/ui/button';
import {
  Dialog,
  DialogContent,
  DialogDescription,
  DialogFooter,
  DialogHeader,
  DialogTitle,
} from '@/components/ui/dialog';

const TermsModal = ({ open, onConfirm }) => {
  return (
    <Dialog open={open}>
      <DialogContent
        closeable={false}
        className="p-0">
        <DialogHeader>
          <DialogTitle className="text-start text-xl font-bold py-4 px-6">
            الشروط والأحكام
          </DialogTitle>
          <div className="text-start p-4">
            <div
              dir="ltr"
              className="scrollbar-custom terms text-lg text-ivory-950 flex flex-col max-h-96 overflow-y-scroll p-4">
              <div
                dir="rtl"
                className="space-y-2">
                <DialogDescription className="font-semibold">
                  الشروط والأحكام الخاصة بلوحة التحكم ملاك المحافظ:
                </DialogDescription>
                <div className="text-sm">
                  <div className="font-semibold text-base">
                    أولاً: التعريفات
                  </div>
                  في هذه الوثيقة، وما لم يقتضي السياق خلاف ذلك يكون للمصطلحات
                  الآتية المعاني المشار إليها قرين كل مصطلح. “الشركة الوطنية
                  المساندة لخدمات التمويل” أو “الشركة” أو “الموقع” أو “ضمير
                  المتكلم” أو “ضمير الملكية” يشير إلى الشركة الوطنية المساندة
                  لخدمات التمويل شركة مساهمة مقفلة بالمملكة العربية السعودية
                  وموقعها الإلكتروني (nfsc.sa) وما يتفرع منه أسما النطاقات
                  الفرعية أو تطبيقات الجوال أو أي وسائل تقنية مشابهة وكافة قنوات
                  ومواقع وصفحات التواصل وتقديم الخدمات الخاصة بنا. “العميل” أو
                  “المستخدم” أو “ضمير المخاطب” يشير إلى كل شخص طبيعي أو معنوي
                  يستخدم أو يطلب أي من خدماتنا الموضحة عبر موقعنا الإلكتروني
                  وكذلك كل شخص يقوم بزيارة الموقع أو استخدامه بأي شكل من
                  الأشكال. “خدماتنا” يشير إلى كل أو بعض الخدمات التي تقدمها
                  الشركة الوطنية المساندة لخدمات التمويل والمعتمدة من البنك
                  المركزي السعودي والتي تشمل على سبيل المثال لا الحصر (خدمات
                  المحافظ: إدارة المحافظ، خدمات المستفيدين، إدارة المستندات.
                  خدمات التحصيل: إدارة العملاء المتعثرين عن السداد، متابعة
                  وإدارة المبالغ المتأخرة، تحديثات سمة. خدمات الاسترداد: خدمات
                  الإفراغ، خدمات التقاضي والترافع، تنفيذ السندات المالية) وكافة
                  الخدمات الأخرى التي نوفرها لعملائنا لاحقاً. “القوانين” أو
                  “الأنظمة” تشير إلى الأنظمة المعمول بها في المملكة العربية
                  السعودية.
                </div>
                <div className="text-sm">
                  <div className="font-semibold text-base">
                    ثانيًا: إدارة الخدمات
                  </div>
                  يتم إدارة خدماتنا بواسطة الشركة الوطنية المساندة لخدمات
                  التمويل أو من تفوضه أو توكله أو تنيبه في تنفيذ كل أو بعض
                  خدماتنا، وبالاستعانة بفريق عمل تابع للشركة لإدارة وتنفيذ
                  الخدمات. يقوم العميل بالتسجيل بالشركة للاستفادة من الخدمات
                  الخاصة بنا عن طريق رقم الأحوال المدنية ورقم الجوال أو مايتطلبه
                  تفعيل الخدمة من بيانات، وسوف يتم تحويل العميل لمنصة خاصة
                  للحصول على الخدمات وتزويدنا بالمعلومات المطلوبة. يحق للشركة
                  تحديد آليات العمل من خلال الموقع أو من خلال الشركة وفقًا
                  لرؤيتنا وبما يتناسب مع طبيعة الخدمات والتحديثات التي تجريها
                  الجهات المختصة والقوانين المعمول بها في المملكة العربية
                  السعودية. لا يحق لأي شخص أو جهة أو مستخدم أو عميل إلزام الشركة
                  اتباع أساليب عمل أو طرق معينة لتحقيق الأهداف، حيث أن الشركة
                  تسعى دائمًا لتحقيق الاستفادة الكاملة من الخدمات من خلال جميع
                  الطرق القانونية المتاحة والمسموح بها طبقًا للقوانين المعمول
                  بها
                </div>
                <div className="text-sm">
                  <div className="font-semibold text-base">
                    ثالثًا: العقد الإلكتروني
                  </div>
                  تعد هذه الوثيقة بمثابة عقد إلكتروني بين الشركة من ناحية
                  ومستخدمي الموقع من ناحية أخرى وتعد هذه الاتفاقية عقد نهائي بين
                  الطرفين يلتزم كل طرف بتنفيذ التزاماته بموجب هذا العقد. يعد هذا
                  العقد الإلكتروني مكمل لأي عقود أخرى مبرمة بين الشركة وأي من
                  مستخدميها وتعد هذه الوثيقة جزء لا يتجزأ من هذا العقد، وفي حال
                  وجود أي تعارض بين نصوص هذه الوثيقة وبين نصوص العقد تطبق النصوص
                  الواردة بالعقد باعتباره اتفاق خاص بين الطرفين
                </div>
                <div className="text-sm">
                  <div className="font-semibold text-base">
                    رابعاً: الرسوم والدفع
                  </div>
                  تلتزم بسداد كافة الرسوم المستحقة للشركة التي يتم الاتفاق عليها
                  عن طريق عقد أو رسالة أو إشعار، على أن يتم الدفع من خلال وسائل
                  الدفع المعتمدة للشركة. أنت تعلم وتوافق على أن الرسوم قد تختلف
                  من حالة لحالة أخرى وبالتالي فالرسوم المستحقة للشركة متغيرة
                  ويتم تحديدها لكل حالة على حده، ويحق للشركة تغيير خطة الرسوم في
                  أي وقت تراه مناسبًا دون تقديم إشعار مسبق لأي من مستخدميها
                </div>
                <div className="text-sm">
                  <div className="font-semibold text-base">
                    خامساً: حقوق الملكية الفكرية
                  </div>
                  تحتفظ الشركة بكافة حقوق التأليف والنشر على الموقع وكافة
                  مكوناته الإلكترونية من تصميمات وبرمجيات وألوان وأشكال ورموز
                  وحروف ومظاهر بصرية خاصة بنا، كما نحتفظ بحقوق التأليف والنشر
                  على جميع المحتوى المتوفر من خلال الموقع. وبالتالي لا يحق لك
                  انتهاك أي من حقوق التأليف والنشر عن طريق الاقتباس أو النسخ أو
                  التعديل أو القرصنة أو غير ذلك. نحتفظ بالحقوق القانونية
                  للعلامات التجارية الخاصة بنا المتمثلة في الشعارات (الشركة
                  الوطنية المساندة لخدمات التمويل) و (NFSC) وأي شعارات أخرى
                  تابعة لخدماتنا، ولا يحق لك استغلال علاماتنا التجارية أو أي من
                  شعاراتنا دون الحصول على موافقة كتابية من إدارة الشركة
                </div>
                <div className="text-sm">
                  <div className="font-semibold text-base">
                    سادسًا: المسؤولية القانونية
                  </div>
                  تتحمل المسؤولية القانونية الكاملة في حال الإخلال بنظام عمل
                  الموقع أو التلاعب بالموقع أو البرمجيات أو التصميمات أو حقوق
                  الملكية الفكرية أو تجاوز حدود التراخيص أو التسبب في مشكلات
                  قانونية للموقع أو إدارة الموقع أو أي من موظفينا أو وكلائنا أو
                  التابعين لنا أو التشهير أو الإساءة لهم. تتحمل المسؤولية
                  القانونية الكاملة في حال إخلالك بأي حقوق مالية للموقع أو
                  الشركة أو قيامك بالتأخير بدفع أي مستحقات أو عدم الالتزام
                  بالدفع أو التسبب في تكبد مصاريف إضافية، مع تحملك لأي تعويضات
                  أو غرامات أو أتعاب محاماة أو أي مصاريف إدارية أو قضائية ناتجة
                  عن إخلالك بالتزاماتك القانونية أو التزاماتك بموجب هذه الوثيقة.
                  نقدم خدماتنا كما هي متوفرة وكلما كان ذلك ممكنًا دون ضمانات
                  إضافية، ولا يتحمل الموقع أو الشركة أي مسئولية قانونية أو
                  تضامنية أو تبعية مع أي أطراف أخرى، ويكون كل طرف مسؤول مسؤولية
                  شخصية عن كافة الأعمال والتصرفات غير القانونية أو الإخلال
                  بالعقود الملزمة دون أدنى مسؤولية على الشركة. لن تكون الشركة
                  ومسئوليها وموظفيها مسئولين قانونًا تجاهك أو تجاه أي طرف آخر عن
                  أي خسارة مباشرة أو غير مباشرة أو عن أي تكلفة أخرى قد تنشأ من
                  أو فيما يتصل بتنفيذ اتفاقية الاستخدام، أو فيما يتصل بتقديم
                  خدماتنا. لا تضمن الشركة عند وقوع أي خلل في تقديم الخدمات خارج
                  عن مقدرتها أو بسبب ظروف طارئة أو قاهرة – عدم حصول أي خلل أو
                  خطأ وتلتزم الشركة باتخاذ كافة الخطوات اللازمة والمعقولة
                  للمعالجة وتدارك الموقف. لا تضمن شركة الشركة أن نتائج استخدام
                  الخدمة ستكون دقيقة أو ثابتة. مع عدم الإخلال بحقوقها الأخرى فان
                  للشركة الحق في وقف أو إلغاء عضويتك أو وصولك إلى الخدمات في أي
                  وقت وبدون إنذار ولأي سبب، ودون تحديد، ويمكنها إلغاء هذه
                  الاتفاقية
                </div>
                <div className="text-sm">
                  <div className="font-semibold text-base">
                    سابعًا: شروط عامة
                  </div>
                  يجب عليك الالتزام بجميع القوانين واللوائح المعمول بها داخل
                  الدولة التي تستخدم الموقع من خلالها وذلك فيما يتعلق باستخدامك
                  للموقع، وتتحمل كافة المسئوليات الناشئة في حالة إخلالك بهذه
                  القوانين أو اللوائح، كما تلتزم بجميع الشروط والأحكام المنصوص
                  عليها في هذه الاتفاقية. أنت توافق على عدم استخدام الموقع أو أي
                  خدمة تقدم من خلاله بطريقة غير قانونية أو احتيالية أو معادية
                  للمجتمع على النحو الذي نقدره. وأنت مسئولاً عن المحافظة على
                  استخدام الموقع بكل جدية ومصداقية. يتعهد المستخدم بتحري الدقة
                  عند إدخال المعلومات المطلوب إدخالها في الموقع، ويكون مسئولاً
                  عن مراجعة تلك المعلومات بشكل دوري بغرض تصحيحها أو تعديلها أو
                  تجديدها كلما توفرت لديك معلومات جديدة بشأنها، على أن تحتفظ
                  بكافة البيانات والمستندات الدالة على ذلك. بالتزامك بشروط
                  الاستخدام أو أي شروط خدمة، تمنحك الشركة ترخيصًا محدودًا وغير
                  حصري، وغير قابل للتحويل وغير قابل للترخيص من الباطن للوصول إلى
                  الاستخدام المقبول لخدمات الموقع. أنت توافق على تلقي الاتصالات
                  منا، وسوف نتواصل معك عن طريق البريد الالكتروني أو رقم الجوال
                  أو من خلال خدمات الموقع الأخرى. أنت توافق على أن جميع
                  الاتفاقات والإشعارات والإفصاحات وغيرها من الاتصالات التي
                  نقدمها لك الكترونيًا تستوفي كافة الشروط القانونية كما لو كانت
                  هذه الاتصالات خطية، وتقوم مقامها في إنتاج آثارها القانونية.
                  يحق للموقع تعديل الشروط والأحكام أو إضافة أي بنود جديدة أو حذف
                  أي بنود قائمة وسنقوم في هذه الحالة بتحديث “تاريخ أخر تحديث”
                  أعلى هذه الوثيقة. يعتبر النص العربي لهذه الاتفاقية هو النص
                  المعتمد لأغراض تفسير وتطبيق شروطها وأحكامها. أي إشعارات تود
                  إرسالها للموقع يجب أن يتم إرسالها عبر الوسائل المحددة داخل
                  الموقع، ولا يعتد بأي إشعارات يتم إرسالها خارج الموقع
                </div>
                <div className="text-sm">
                  <div className="font-semibold">ثامنًا: فسخ الاتفاقية</div>
                  هذه الاتفاقية ملزمة لجميع الأطراف، ويحق للموقع فسخها في حال
                  إخلالك بأي حقوق قانونية منصوص عليها في هذه الوثيقة أو قيامك
                  بارتكاب أي مخالفات للقوانين المعمول بها، مع التزامك بدفع أي
                  غرامات أو تعويضات ناشئة عن هذا الإخلال. وتظل كافة الأثار
                  القانونية الناشئة في ظل سريان الاتفاقية ملزمة لجميع مستخدمي
                  الموقع. تاسعًا: القانون واجب التطبيق والمحاكم المختصة يحكم هذه
                  الاتفاقية القوانين والأنظمة المعمول بها والسارية المفعول داخل
                  المملكة العربية السعودية. يختص القضاء داخل المملكة العربية
                  السعودية بأي نزاع قد ينشأ عن تفسير أو تنفيذ أحكام هذه
                  الاتفاقية. في حال أصبح أي حكم من أحكام هذه الاتفاقية غير ساري
                  أو غير قانوني أو غير قابل للتنفيذ، فان قانونية وقابلية تنفيذ
                  الأحكام الأخرى لن تتأثر بأي طريقة كانت بذلك الحكم
                </div>
              </div>
            </div>
          </div>
        </DialogHeader>
        <DialogFooter className="p-4 flex items-end justify-end">
          <Button
            className="w-max"
            onClick={onConfirm}>
            نعم، أنا أوافق
          </Button>
        </DialogFooter>
      </DialogContent>
    </Dialog>
  );
};

export default TermsModal;
