import { ArrowRight } from 'lucide-react';

const TermsAndConditions = ({ onHideTerms }) => {
  return (
    <div className="flex items-center justify-center flex-col">
      <div className="flex items-center gap-2 mb-4 w-10/12">
        <span
          className="cursor-pointer text-ivory-950 p-2"
          onClick={onHideTerms}>
          <ArrowRight size={30} />
        </span>
        <span className="self-start text-xl h-10 flex items-center font-semibold">
          الشروط والأحكام
        </span>
      </div>
      <div
        dir="ltr"
        className="scrollbar-custom terms text-lg text-ivory-950 font-semibold flex flex-col w-10/12 max-h-96 overflow-y-scroll p-4">
        <div dir="rtl">
          <p>الشروط والأحكام الخاصة بلوحة التحكم ملاك المحافظ:</p>
          <p>
            1. تعريف لوحة التحكم لوحة التحكم: هي واجهة مخصصة للمستخدمين المسجلين
            تتيح لهم الوصول إلى البيانات والوظائف المتعلقة بخدمات التطبيق، مثل
            إدارة العقارات، عرض الإحصائيات، وحفظ الإعدادات.
          </p>
          <p>
            2. استخدام لوحة التحكم يُتاح الوصول إلى لوحة التحكم للمستخدمين
            المصرح لهم فقط بعد تسجيل الدخول باستخدام بيانات الاعتماد الشخصية
            (اسم المستخدم وكلمة المرور). يُحظر مشاركة بيانات تسجيل الدخول مع أي
            طرف ثالث.
          </p>
          <p>
            3. وظائف لوحة التحكم لوحة التحكم تشمل الميزات التالية: إدارة
            العقارات: إضافة، تعديل، أو حذف العقارات المدرجة. عرض حالة العقارات
            (متاحة، مباعة، تحت العرض). الإحصائيات والتقارير: عرض إحصائيات حول
            العقارات المدرجة، مثل عدد الزيارات وعدد الحجوزات. تقارير مخصصة بناءً
            على الفترة الزمنية أو نوع العقار. إشعارات: استقبال الإشعارات
            المتعلقة بالحجوزات أو التعديلات على القوائم.
          </p>
          <p>
            4. مسؤولية المستخدمين يتحمل المستخدم المسؤولية الكاملة عن الأنشطة
            التي تتم باستخدام حسابه على لوحة التحكم. يجب الإبلاغ فورًا عن أي
            استخدام غير مصرح به للحساب. يُحظر تحميل أي معلومات خاطئة أو مضللة عن
            العقارات.
          </p>
          <p>
            5. قيود الاستخدام يُحظر استخدام لوحة التحكم لأي غرض غير مشروع أو
            ينتهك القوانين واللوائح المعمول بها في المملكة العربية السعودية.
            يُمنع التدخل في تشغيل لوحة التحكم أو محاولة الوصول غير المصرح به إلى
            بيانات أو حسابات أخرى.
          </p>
          <p>
            6. حقوق الشركة تحتفظ الشركة بالحق في: تعليق أو إلغاء حساب أي مستخدم
            ينتهك الشروط والأحكام. إجراء تحديثات أو تغييرات على لوحة التحكم دون
            إشعار مسبق. مراقبة النشاط على لوحة التحكم لضمان الامتثال لهذه
            الشروط.
          </p>
          <p>
            7. حدود المسؤولية الشركة غير مسؤولة عن أي خسائر تنشأ عن سوء استخدام
            لوحة التحكم. الشركة لا تضمن خلو لوحة التحكم من الأخطاء التقنية أو
            الأعطال، ولكنها تعمل على إصلاحها في أسرع وقت ممكن.
          </p>
          <p>
            8. التحديثات على الشروط قد يتم تحديث هذه الشروط والأحكام من وقت
            لآخر. يُنصح المستخدمون بمراجعة هذه الصفحة بانتظام لضمان معرفة أي
            تغييرات.
          </p>
          <p>
            9. الاتصال بنا في حال وجود أي استفسارات أو مشاكل متعلقة بلوحة
            التحكم، يُرجى التواصل مع: البريد الإلكتروني: support@nfsc.com رقم
            الهاتف: +966 [رقم الهاتف]
          </p>
        </div>
      </div>
    </div>
  );
};

export default TermsAndConditions;
